Catalogs/Renault_ДилерскиеПочтовыеЯщикиНаЦентральномСервере.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_ДилерскиеПочтовыеЯщикиНаЦентральномСервере</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресПочтовогоЯщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BIR</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойДляПочты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойДляЛидов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованойДляСервиса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Renault_ДилерскиеПочтовыеЯщикиНаЦентральномСервере/Ext/ManagerModule.bsl
Функция ПолучитьОсновнойЯщикДляПочты(BIR) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ДилерскиеПочтовыеЯщикиНаЦентральномСервере.Ссылка
	|ИЗ
	|	Справочник.Renault_ДилерскиеПочтовыеЯщикиНаЦентральномСервере КАК Renault_ДилерскиеПочтовыеЯщикиНаЦентральномСервере
	|ГДЕ
	|	Renault_ДилерскиеПочтовыеЯщикиНаЦентральномСервере.BIR = &BIR
	|	И Renault_ДилерскиеПочтовыеЯщикиНаЦентральномСервере.ОсновнойДляПочты = ИСТИНА";
	Запрос.УстановитьПараметр("BIR", BIR);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.Renault_ДилерскиеПочтовыеЯщикиНаЦентральномСервере.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Функция ПолучитьОсновнойЯщикДляЛидов(BIR) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ДилерскиеПочтовыеЯщикиНаЦентральномСервере.Ссылка
	|ИЗ
	|	Справочник.Renault_ДилерскиеПочтовыеЯщикиНаЦентральномСервере КАК Renault_ДилерскиеПочтовыеЯщикиНаЦентральномСервере
	|ГДЕ
	|	Renault_ДилерскиеПочтовыеЯщикиНаЦентральномСервере.BIR = &BIR
	|	И Renault_ДилерскиеПочтовыеЯщикиНаЦентральномСервере.ОсновнойДляЛидов = ИСТИНА";
	Запрос.УстановитьПараметр("BIR", BIR);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.Renault_ДилерскиеПочтовыеЯщикиНаЦентральномСервере.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Функция ПолучитьОсновнойЯщикДляСервиса(BIR) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ДилерскиеПочтовыеЯщикиНаЦентральномСервере.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Renault_ДилерскиеПочтовыеЯщикиНаЦентральномСервере КАК Renault_ДилерскиеПочтовыеЯщикиНаЦентральномСервере
	|ГДЕ
	|	Renault_ДилерскиеПочтовыеЯщикиНаЦентральномСервере.BIR = &BIR
	|	И Renault_ДилерскиеПочтовыеЯщикиНаЦентральномСервере.ОснованойДляСервиса = ИСТИНА";
	Запрос.УстановитьПараметр("BIR", BIR);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.Renault_ДилерскиеПочтовыеЯщикиНаЦентральномСервере.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции
